app/views/groups/show.html.erb

<a href="/groups/">Dashboard</a>
<!-- <% if !current_user.groups.includes(@group) %>
---
SELECT "groups".* FROM "groups"

<p>Created By:
    <% if @group.user.first_name == current_user.first_name %> YOU
---
SELECT "users".* FROM "users" INNER JOIN "attendees" ON "users"."id" = "attendees"."user_id" WHERE "attendees"."group_id" = ?  [["group_id", 3]]