app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees"
---
    def index
        @groups = Group.all
        @user = User.find(session[:user_id])
        @attendee = Attendee.all

INSERT INTO "groups" ("org_name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["org_name", ""], ["description", ""], ["user_id", 1], ["created_at", "2019-08-29 17:08:13.868054"], ["updated_at", "2019-08-29 17:08:13.868054"]]
SELECT MAX("groups"."id") FROM "groups"
SELECT  "groups"."id" FROM "groups" WHERE "groups"."org_name" = ? LIMIT ?  [["org_name", "Soapyyyyyyyy"], ["LIMIT", 1]]
---
    def create
        @group = Group.new
        @group.org_name = params[:org_name]
        @group.description = params[:description]
        @group.user = current_user
        if @group.save
            @insertedGroup_id = Group.maximum('id')
            @currentGroup=Group.find_by(org_name:@group.org_name)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "attendees".* FROM "attendees"
---
    def show
        @group = Group.find(params[:id])
        @attendee = Attendee.all

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def join
        if do_join(Group.find(params[:id]),current_user)

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."user_id" = 9 LIMIT ?  [["LIMIT", 1]]
DELETE FROM "attendees" WHERE "attendees"."id" = ?  [["id", 1]]
---
    def leave
        @attendee = Attendee.find_by(user_id: current_user)
        if @attendee
            @attendee.destroy

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
---
    def delete_group
        @group = Group.find_by(id: params[:id])
        if @group
            @group.destroy